//*Описать класс дробей — рациональных чисел, являющихся отношением двух целых чисел.
//Предусмотреть методы сложения, вычитания, умножения и деления дробей.
//Написать программу, демонстрирующую все разработанные элементы класса.
//Добавить свойства типа int для доступа к числителю и знаменателю;
//Добавить свойство типа double только на чтение, чтобы получить десятичную дробь числа;
//**Добавить проверку, чтобы знаменатель не равнялся 0.
//Выбрасывать исключение ArgumentException("Знаменатель не может быть равен 0");
//***Добавить упрощение дробей.
string delitel;
//  class  x/y =  -inf do +inf/-inf do +inf
//   x/y + x/y,
//   x/y - x/y,
//   x/y / x/y,
//   x/y * x/y
// int = ReadLine для numerator и denominator
// double для x/y = #,##...
// проверка y != 0
//Выбрасывать исключение ArgumentException("Знаменатель не может быть равен 0");
//Добавить упрощение дробей.
